#pragma once
#include<vector>
#include<string>

class Neuron
{
public:
	Neuron() {};
	~Neuron() {};
	
	std::string check(double a, double b);

	std::vector<double> x{ 55.753742, 55.838384, 55.863833, 55.787710, 55.692019, 55.610906, 55.662735, 55.728003, 55.4900, 55.5952, 55.558121 };
	std::vector<double> y{ 37.615533, 37.525765, 37.620366, 37.775631, 37.754583, 37.681479, 37.576178, 37.443533, 37.2600, 37.1125, 37.370724 };
	std::vector<std::string> name{"Центральный", "Северный", "Северо-Восточный", "Восточный", "Юго-Восточный", "Южный", "Юго-Западный", "Западный", "Северо-Западный", "Зеленоград", "Новомосковский" };
};

